Конфигурация/Catalogs/УровниДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>УровниДоступа</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Чтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Добавление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регистрация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧтениеБезОграничения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменениеБезОграничения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/УровниДоступа/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Начальное заполнение справочника.
//
Процедура ЗаполнитьРеквизитыПредопределенныхЭлементов() Экспорт
	
	Права = Новый Структура("Чтение", Истина);
	ЗаполнитьРеквизитыПредопределенногоЭлемента("Чтение", 1, Права);
	
	Права = Новый Структура("Чтение, Изменение, Добавление, Удаление",
		Истина, Истина, Истина, Истина);
	ЗаполнитьРеквизитыПредопределенногоЭлемента("Редактирование", 2, Права);
	
	Права = Новый Структура("Чтение, Изменение, Добавление, Удаление, Регистрация",
		Истина, Истина, Истина, Истина, Истина);
	ЗаполнитьРеквизитыПредопределенногоЭлемента("Регистрация", 3, Права);
	
	Права = Новый Структура("ЧтениеБезОграничения", Истина);
	ЗаполнитьРеквизитыПредопределенногоЭлемента("ЧтениеБезОграничения", 4, Права);

	Права = Новый Структура("ЧтениеБезОграничения, ИзменениеБезОграничения", Истина, Истина);
	ЗаполнитьРеквизитыПредопределенногоЭлемента("РедактированиеБезОграничения", 5, Права);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыПредопределенногоЭлемента(Имя, Приоритет, Права) Экспорт
	
	УровеньДоступаОбъект = Справочники.УровниДоступа[Имя].ПолучитьОбъект();
	УровеньДоступаОбъект.Приоритет = Приоритет;
	ЗаполнитьЗначенияСвойств(УровеньДоступаОбъект, Права);
	УровеньДоступаОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
